# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Fri Apr 25 14:41:51 IST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design calculator_fsm

create_clock -name "clk" -period 12.0 -waveform {0.0 1.0} [get_ports clk]
set_clock_transition 0.2 [get_clocks clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports reset]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports start]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {A[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {B[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {op_sel[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {op_sel[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {op_sel[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {op_sel[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports {result[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.5 [get_ports done]
set_input_transition 0.1 [get_ports clk]
set_input_transition 0.1 [get_ports reset]
set_input_transition 0.1 [get_ports start]
set_input_transition 0.1 [get_ports {A[15]}]
set_input_transition 0.1 [get_ports {A[14]}]
set_input_transition 0.1 [get_ports {A[13]}]
set_input_transition 0.1 [get_ports {A[12]}]
set_input_transition 0.1 [get_ports {A[11]}]
set_input_transition 0.1 [get_ports {A[10]}]
set_input_transition 0.1 [get_ports {A[9]}]
set_input_transition 0.1 [get_ports {A[8]}]
set_input_transition 0.1 [get_ports {A[7]}]
set_input_transition 0.1 [get_ports {A[6]}]
set_input_transition 0.1 [get_ports {A[5]}]
set_input_transition 0.1 [get_ports {A[4]}]
set_input_transition 0.1 [get_ports {A[3]}]
set_input_transition 0.1 [get_ports {A[2]}]
set_input_transition 0.1 [get_ports {A[1]}]
set_input_transition 0.1 [get_ports {A[0]}]
set_input_transition 0.1 [get_ports {B[15]}]
set_input_transition 0.1 [get_ports {B[14]}]
set_input_transition 0.1 [get_ports {B[13]}]
set_input_transition 0.1 [get_ports {B[12]}]
set_input_transition 0.1 [get_ports {B[11]}]
set_input_transition 0.1 [get_ports {B[10]}]
set_input_transition 0.1 [get_ports {B[9]}]
set_input_transition 0.1 [get_ports {B[8]}]
set_input_transition 0.1 [get_ports {B[7]}]
set_input_transition 0.1 [get_ports {B[6]}]
set_input_transition 0.1 [get_ports {B[5]}]
set_input_transition 0.1 [get_ports {B[4]}]
set_input_transition 0.1 [get_ports {B[3]}]
set_input_transition 0.1 [get_ports {B[2]}]
set_input_transition 0.1 [get_ports {B[1]}]
set_input_transition 0.1 [get_ports {B[0]}]
set_input_transition 0.1 [get_ports {op_sel[3]}]
set_input_transition 0.1 [get_ports {op_sel[2]}]
set_input_transition 0.1 [get_ports {op_sel[1]}]
set_input_transition 0.1 [get_ports {op_sel[0]}]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.02 [get_clocks clk]
set_clock_uncertainty -hold 0.02 [get_clocks clk]
